tutorials/radial_crystallizer/system/blockMeshDict
/*-----------------------------------------------------*\ 
| ========= | | 
| \ / F ield | OpenFOAM: The Open Source CFD Toolbox | 
| \ / O peration | Version: 1.3 | 
| \ / A nd | Web: http://www.openfoam.org | 
| \/ M anipulation | | 
\*-----------------------------------------------------*/ 

FoamFile 
{ 
version 2.0; 
format ascii; 

root ""; 
case ""; 
instance ""; 
local ""; 

class dictionary; 
object blockMeshDict; 
} 

// * * * * * * * * * * * * * * * * * * * * * * * * * *// 
//meshGenApp blockMesh; 
convertToMeters 0.001; 
vertices 
( 
  (0 -40 0)
  (18.16 -40 0)
  (18.16 40 0)
  (0 40 0)

  (0 -40 1000)
  (18.16 -40 1000)
  (18.16 40 1000)
  (0 40 1000)

); 
blocks 
( 
  hex (0 1 2 3 4 5 6 7) (10 20 250) 
  simpleGrading
  (
    1
    1
    ((0.2 0.3 1) (0.8 0.7 2))
  ) 
); 
edges 
( 
); 

boundary
( 
  walls
  {
    type wall;
    faces
    (
      (0 1 2 3)
      (1 2 5 6)
      (0 1 4 5)
      (2 3 6 7)
      (0 3 4 7)
    );
  }
  outlet
  {
    type patch;
    faces
    (
      (4 5 6 7)
    );
  }
); 
mergePatchPairs 
( 
);