tutorials/radial_crystallizer/constant/PBEdict
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  2.3.1                                 |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    location    "constant";
    object      PBEdict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //
rend (0.0000E+00
        8.3333E-06
        1.6667E-05
        2.5000E-05
        3.3333E-05
        4.1667E-05
        5.0000E-05
        5.8333E-05
        6.6667E-05
        7.5000E-05
        8.3333E-05
        9.1667E-05
        1.0000E-04
        1.0833E-04
        1.1667E-04
        1.2500E-04
        1.3333E-04
        1.4167E-04
        1.5000E-04
        1.5833E-04
        1.6667E-04
        1.7500E-04
        1.8333E-04
        1.9167E-04
        2.0000E-04
        2.0833E-04
        2.1667E-04
        2.2500E-04
        2.3333E-04
        2.4167E-04
        2.5000E-04);

diffusivity diffusivity [0 2 -1 0 0 0 0] 1.00E-09;

density density [1 -3 0 0 0 0 0] 1273.0;

dH_crystallization dH_crystallization [0 2 -2 0 0 0 0] 94038.91;

volumeShapeFactor volumeShapeFactor [0 -3 0 0 0 0 0] 0.0006250;

minmodTheta minmodTheta [0 -3 0 0 0 0 0] 1.5;

inletPatchName (solution_inlet);
outletPatchName (outlet);

patchName (internalField);

wallRegions (wall);

internalField
{
  value  (0
            0
            0
            0
            0
            0
            0
            0
            0
            0
            0
            0
            0
            0
            0
            0
            0
            0
            0
            0
            0
            0
            0
            0
            0
            0
            0
            0
            0
            0);
}



// ************************************************************************* //
