tutorials/radial_crystallizer/0.org/epsilon
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  2.3.0                                 |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    location    "0";
    object      epsilon;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 2 -3 0 0 0 0];

internalField   uniform 10;

boundaryField
{
    symmetry_plane
    {
        type            symmetry;
    }
    sup_side_inlet
    {
        type            turbulentMixingLengthDissipationRateInlet;
        mixingLength    0.000287;
        value           uniform 0.00093;
    }
    inf_side_inlet
    {
        type            turbulentMixingLengthDissipationRateInlet;
        mixingLength    0.000287;
        value           uniform 0.00093;
    }
    outlet
    {
        type            zeroGradient;
    }
    walls
    {
        type            epsilonWallFunction;
        value           uniform 0.0003153;
        Cmu             0.09;
        kappa           0.41;
        E               9.8;
        value           uniform 0.0003153;
    }
    solution_inlet
    {
        type            turbulentMixingLengthDissipationRateInlet;
        mixingLength    0.001302;
        value           uniform 0.0003153;
    }
}


// ************************************************************************* //
