tutorials/radial_crystallizer/0.org/he
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  2.3.1                                 |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    object      p;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 2 -2 0 0 0 0];

internalField   uniform -30000;

boundaryField
{
    solution_inlet
    {
        type            fixedValue;
	value 		uniform 0.0;
    }

    outlet
    {
        type            zeroGradient;
    }

    walls
    {
        type            zeroGradient;
    }

    sup_side_inlet
    {
        type            fixedValue;
	value		uniform -50196.0;
    }
    inf_side_inlet
    {
        type            fixedValue;
	value		uniform -50196.0;
    }
    symmetry_plane
    {
      type		symmetry;
    }
}

// ************************************************************************* //
